#===========================================================
# サークルのサーバへのssh接続を楽にする
#   IPアドレスの4オクテット目の入力だけで接続可能
#   ただし、ユーザ名の指定は l オプションで
#===========================================================
local sshl=$zsh_dir/ssh-labo.sh
if [ -e $sshl ] ; then
  source $sshl
fi

#====================================================================
# 256色表示確認                                                     #
#====================================================================
function pcolor() {
  for ((f = 0; f < 255; f++))
  do
    printf "\e[38;5;%dm %3d*■\e[m" $f $f
    [[ $f%8 -eq 7 ]] && printf "\n"
  done
  echo
}

#===========================================================
#  絶対パスへ展開してヒストリ登録するcd
#===========================================================
local zcd_file=$zsh_dir/zcd.zsh
[ -e $zcd_file ] && source $zcd_file
alias cd='zcd'

#===========================================================
#  ssh-agentをssh系コマンド実行前に実行
#===========================================================
## ssh-agent をssh,scp,sftp,rsyncに関連付け
local overssh=$zsh_dir/pressh_agent.sh
[ -e $overssh ] && source $overssh
